In [2]:
import pandas as pd

In [ ]:
df = function(filename.)

In [14]:
x = pd.read_excel(r"C:\Users\patel\Desktop\Excel file exampal.xlsx")

In [16]:
x

   Unnamed: 0 Unnamed: 1       Unnamed: 2 Unnamed: 3 Unnamed: 4
0         NaN     Sr.No             Name     Emp id      Salary
1         NaN          1       Nil Patel        4625      20500
2         NaN          2  Pinku choudhary      11352      42000